<a href='http://www.adejumoridwan.com'> <img src='../ridwan.png' /></a>

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [11]:
df['W']

A   -2.141212
B    1.292765
C    0.485809
D    1.541990
E    1.407338
Name: W, dtype: float64

In [12]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A -2.141212 -1.046780
B  1.292765 -0.162535
C  0.485809 -0.855196
D  1.541990 -0.568581
E  1.407338 -0.391157

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

DataFrame Columns are just Series

In [13]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [14]:
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A -2.141212  0.992573  1.192241 -1.046780 -0.948972
B  1.292765 -1.467514 -0.494095 -0.162535  0.798669
C  0.485809  0.392489  0.221491 -0.855196  0.707299
D  1.541990  0.666319 -0.538235 -0.568581  1.003756
E  1.407338  0.641806 -0.905100 -0.391157  0.502238

** Removing Columns**

In [16]:
df.drop('new',axis=1)

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

In [17]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -2.141212  0.992573  1.192241 -1.046780 -0.948972
B  1.292765 -1.467514 -0.494095 -0.162535  0.798669
C  0.485809  0.392489  0.221491 -0.855196  0.707299
D  1.541990  0.666319 -0.538235 -0.568581  1.003756
E  1.407338  0.641806 -0.905100 -0.391157  0.502238

In [ ]:
df.drop('new',axis=1,inplace=True)

In [ ]:
?df.drop

Can also drop rows this way:

In [21]:
df.drop('E',axis=0)

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581

** Selecting Rows**

In [25]:
df.loc['A']

W   -2.141212
X    0.992573
Y    1.192241
Z   -1.046780
Name: A, dtype: float64

Or select based off of position instead of label

In [29]:
df.iloc[2]

W    0.485809
X    0.392489
Y    0.221491
Z   -0.855196
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [27]:
df.loc['B','Y']

-0.49409535833912277

In [28]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -2.141212  1.192241
B  1.292765 -0.494095

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [30]:
df

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

In [31]:
df>0

       W      X      Y      Z
A  False   True   True  False
B   True  False  False  False
C   True   True   True  False
D   True   True  False  False
E   True   True  False  False

In [32]:
df[df>0]

          W         X         Y   Z
A       NaN  0.992573  1.192241 NaN
B  1.292765       NaN       NaN NaN
C  0.485809  0.392489  0.221491 NaN
D  1.541990  0.666319       NaN NaN
E  1.407338  0.641806       NaN NaN

In [33]:
df[df['W']>0]

          W         X         Y         Z
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

In [35]:
df[df['W']>0]['Y']

B   -0.494095
C    0.221491
D   -0.538235
E   -0.905100
Name: Y, dtype: float64

In [36]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.494095 -1.467514
C  0.221491  0.392489
D -0.538235  0.666319
E -0.905100  0.641806

For two conditions you can use | and & with parenthesis:

In [41]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [42]:
df

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

In [43]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -2.141212  0.992573  1.192241 -1.046780
1     B  1.292765 -1.467514 -0.494095 -0.162535
2     C  0.485809  0.392489  0.221491 -0.855196
3     D  1.541990  0.666319 -0.538235 -0.568581
4     E  1.407338  0.641806 -0.905100 -0.391157

In [44]:
newind = 'CA NY WY OR CO'.split()

In [45]:
df['States'] = newind

In [46]:
df

          W         X         Y         Z States
A -2.141212  0.992573  1.192241 -1.046780     CA
B  1.292765 -1.467514 -0.494095 -0.162535     NY
C  0.485809  0.392489  0.221491 -0.855196     WY
D  1.541990  0.666319 -0.538235 -0.568581     OR
E  1.407338  0.641806 -0.905100 -0.391157     CO

In [47]:
df.set_index('States')

               W         X         Y         Z
States
CA     -2.141212  0.992573  1.192241 -1.046780
NY      1.292765 -1.467514 -0.494095 -0.162535
WY      0.485809  0.392489  0.221491 -0.855196
OR      1.541990  0.666319 -0.538235 -0.568581
CO      1.407338  0.641806 -0.905100 -0.391157

In [ ]:
df

In [48]:
df.set_index('States',inplace=True)

In [49]:
df

               W         X         Y         Z
States
CA     -2.141212  0.992573  1.192241 -1.046780
NY      1.292765 -1.467514 -0.494095 -0.162535
WY      0.485809  0.392489  0.221491 -0.855196
OR      1.541990  0.666319 -0.538235 -0.568581
CO      1.407338  0.641806 -0.905100 -0.391157

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [50]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [54]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [55]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.110477 -0.804652
   2  0.253548  0.649148
   3  0.358941 -1.080471
G2 1  0.902398  0.161781
   2  0.833029  0.975720
   3 -0.388239  0.783316

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [63]:
df.loc['G1']

          A         B
1  0.110477 -0.804652
2  0.253548  0.649148
3  0.358941 -1.080471

In [65]:
df.loc['G1'].loc[1]

A    0.110477
B   -0.804652
Name: 1, dtype: float64

In [66]:
df.index.names

FrozenList([None, None])

In [67]:
df.index.names = ['Group','Num']

In [68]:
df

                  A         B
Group Num
G1    1    0.110477 -0.804652
      2    0.253548  0.649148
      3    0.358941 -1.080471
G2    1    0.902398  0.161781
      2    0.833029  0.975720
      3   -0.388239  0.783316

In [69]:
df.xs('G1')

            A         B
Num
1    0.110477 -0.804652
2    0.253548  0.649148
3    0.358941 -1.080471

In [72]:
df.xs(['G1',1])

C:\Users\Adejumo\AppData\Local\Temp\ipykernel_12940\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    0.110477
B   -0.804652
Name: (G1, 1), dtype: float64

In [73]:
df.xs(1,level='Num')

              A         B
Group
G1     0.110477 -0.804652
G2     0.902398  0.161781

# Great Job!